sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_i2c.h
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001080) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000010A0) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x000010A8) Interrupt clear */
} I2C_DMA_TRIG0_Regs;

/*@}*/ /* end of group I2C_DMA_TRIG0 */

/** @addtogroup I2C_DMA_TRIG1
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) Interrupt clear */
} I2C_DMA_TRIG1_Regs;

/*@}*/ /* end of group I2C_DMA_TRIG1 */

/** @addtogroup I2C_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} I2C_CPU_INT_Regs;

/*@}*/ /* end of group I2C_CPU_INT */

/** @addtogroup I2C_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00000808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} I2C_GPRCM_Regs;

/*@}*/ /* end of group I2C_GPRCM */

/** @addtogroup I2C
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  I2C_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[506];
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00001000) Clock Divider */
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00001004) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED2[4];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED3;
  I2C_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED4;
  I2C_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00001050) */
       uint32_t RESERVED5;
  I2C_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00001080) */
       uint32_t RESERVED6[13];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
  __IO uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
       uint32_t RESERVED7[5];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
       uint32_t RESERVED8[64];
  __IO uint32_t GFCTL;                             /* !< (@ 0x00001200) I2C Glitch Filter Control */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00001204) I2C Timeout Count Control Register */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00001208) I2C Timeout Count Register */
       uint32_t RESERVED9;
  I2C_MASTER_Regs  MASTER;                            /* !< (@ 0x00001210) */
       uint32_t RESERVED10[2];
  I2C_SLAVE_Regs  SLAVE;                             /* !< (@ 0x00001250) */
} I2C_Regs;

/*@}*/ /* end of group I2C */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* I2C Register Control Bits
******************************************************************************/

/* I2C_SOAR Bits */
/* I2C_SOAR[OAR] Bits */
#define I2C_SOAR_OAR_OFS                         (0)                             /* !< OAR Offset */
#define I2C_SOAR_OAR_MASK                        ((uint32_t)0x000003FFU)         /* !< I2C Target Own Address: This field
                                                                                    specifies bits A9 through A0 of the
                                                                                    Target address. In 7-bit addressing
                                                                                    mode as selected by I2CSOAR.MODE bit,
                                                                                    the top 3 bits are don't care */
#define I2C_SOAR_OAR_MINIMUM                     ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_SOAR_OAR_MAXIMUM                     ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* I2C_SOAR[OAREN] Bits */
#define I2C_SOAR_OAREN_OFS                       (14)                            /* !< OAREN Offset */
#define I2C_SOAR_OAREN_MASK                      ((uint32_t)0x00004000U)         /* !< I2C Target Own Address Enable */
#define I2C_SOAR_OAREN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Disable OAR address */
#define I2C_SOAR_OAREN_ENABLE                    ((uint32_t)0x00004000U)         /* !< Enable OAR address */
/* I2C_SOAR[SMODE] Bits */
#define I2C_SOAR_SMODE_OFS                       (15)                            /* !< SMODE Offset */
#define I2C_SOAR_SMODE_MASK                      ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used in Target mode. When 0,
                                                                                    7-bit addressing is used. When 1,
                                                                                    10-bit addressing is used. */
#define I2C_SOAR_SMODE_MODE7                     ((uint32_t)0x00000000U)         /* !< Enable 7-bit addressing */
#define I2C_SOAR_SMODE_MODE10                    ((uint32_t)0x00008000U)         /* !< Enable 10-bit addressing */

/* I2C_SOAR2 Bits */
/* I2C_SOAR2[OAR2] Bits */
#define I2C_SOAR2_OAR2_OFS                       (0)                             /* !< OAR2 Offset */
#define I2C_SOAR2_OAR2_MASK                      ((uint32_t)0x0000007FU)         /* !< I2C Target Own Address 2This field
                                                                                    specifies the alternate OAR2 address. */
#define I2C_SOAR2_OAR2_MINIMUM                   ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_SOAR2_OAR2_MAXIMUM                   ((uint32_t)0x0000007FU)         /* !< Highest possible value */
/* I2C_SOAR2[OAR2EN] Bits */
#define I2C_SOAR2_OAR2EN_OFS                     (7)                             /* !< OAR2EN Offset */
#define I2C_SOAR2_OAR2EN_MASK                    ((uint32_t)0x00000080U)         /* !< I2C Target Own Address 2 Enable */
#define I2C_SOAR2_OAR2EN_DISABLE                 ((uint32_t)0x00000000U)         /* !< The alternate address is disabled. */
#define I2C_SOAR2_OAR2EN_ENABLE                  ((uint32_t)0x00000080U)         /* !< Enables the use of the alternate
                                                                                    address in the OAR2 field. */
/* I2C_SOAR2[OAR2_MASK] Bits */
#define I2C_SOAR2_OAR2_MASK_OFS                  (16)                            /* !< OAR2_MASK Offset */
#define I2C_SOAR2_OAR2_MASK_MASK                 ((uint32_t)0x007F0000U)         /* !< I2C Target Own Address 2 Mask: This
                                                                                    field specifies bits A6 through A0 of
                                                                                    the Target address. The bits with
                                                                                    value 1 in SOAR2.OAR2_MASK field will
                                                                                    make the corresponding incoming
                                                                                    address bits to match by default
                                                                                    regardless of the value inside
                                                                                    SOAR2.OAR2 i.e. corresponding
                                                                                    SOAR2.OAR2 bit is a dont care. */
#define I2C_SOAR2_OAR2_MASK_MINIMUM              ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define I2C_SOAR2_OAR2_MASK_MAXIMUM              ((uint32_t)0x007F0000U)         /* !< Maximum Value */

