sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_CPU_INT_RIS Bits */
/* I2C_CPU_INT_RIS[MRXDONE] Bits */
#define I2C_CPU_INT_RIS_MRXDONE_OFS              (0)                             /* !< MRXDONE Offset */
#define I2C_CPU_INT_RIS_MRXDONE_MASK             ((uint32_t)0x00000001U)         /* !< Controller Receive Transaction
                                                                                    completed Interrupt */
#define I2C_CPU_INT_RIS_MRXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MRXDONE_SET              ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[TIMEOUTA] Bits */
#define I2C_CPU_INT_RIS_TIMEOUTA_OFS             (14)                            /* !< TIMEOUTA Offset */
#define I2C_CPU_INT_RIS_TIMEOUTA_MASK            ((uint32_t)0x00004000U)         /* !< Timeout A Interrupt */
#define I2C_CPU_INT_RIS_TIMEOUTA_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_TIMEOUTA_SET             ((uint32_t)0x00004000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MNACK] Bits */
#define I2C_CPU_INT_RIS_MNACK_OFS                (7)                             /* !< MNACK Offset */
#define I2C_CPU_INT_RIS_MNACK_MASK               ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt */
#define I2C_CPU_INT_RIS_MNACK_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MNACK_SET                ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MSTART] Bits */
#define I2C_CPU_INT_RIS_MSTART_OFS               (8)                             /* !< MSTART Offset */
#define I2C_CPU_INT_RIS_MSTART_MASK              ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define I2C_CPU_INT_RIS_MSTART_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MSTART_SET               ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MSTOP] Bits */
#define I2C_CPU_INT_RIS_MSTOP_OFS                (9)                             /* !< MSTOP Offset */
#define I2C_CPU_INT_RIS_MSTOP_MASK               ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define I2C_CPU_INT_RIS_MSTOP_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MSTOP_SET                ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MARBLOST] Bits */
#define I2C_CPU_INT_RIS_MARBLOST_OFS             (10)                            /* !< MARBLOST Offset */
#define I2C_CPU_INT_RIS_MARBLOST_MASK            ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt */
#define I2C_CPU_INT_RIS_MARBLOST_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MARBLOST_SET             ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MTXDONE] Bits */
#define I2C_CPU_INT_RIS_MTXDONE_OFS              (1)                             /* !< MTXDONE Offset */
#define I2C_CPU_INT_RIS_MTXDONE_MASK             ((uint32_t)0x00000002U)         /* !< Controller Transmit Transaction
                                                                                    completed Interrupt */
#define I2C_CPU_INT_RIS_MTXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MTXDONE_SET              ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MRXFIFOFULL] Bits */
#define I2C_CPU_INT_RIS_MRXFIFOFULL_OFS          (4)                             /* !< MRXFIFOFULL Offset */
#define I2C_CPU_INT_RIS_MRXFIFOFULL_MASK         ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define I2C_CPU_INT_RIS_MRXFIFOFULL_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MRXFIFOFULL_SET          ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MTXEMPTY] Bits */
#define I2C_CPU_INT_RIS_MTXEMPTY_OFS             (5)                             /* !< MTXEMPTY Offset */
#define I2C_CPU_INT_RIS_MTXEMPTY_MASK            ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define I2C_CPU_INT_RIS_MTXEMPTY_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MTXEMPTY_SET             ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MRXFIFOTRG] Bits */
#define I2C_CPU_INT_RIS_MRXFIFOTRG_OFS           (2)                             /* !< MRXFIFOTRG Offset */
#define I2C_CPU_INT_RIS_MRXFIFOTRG_MASK          ((uint32_t)0x00000004U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_CPU_INT_RIS_MRXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_RIS_MRXFIFOTRG_SET           ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MTXFIFOTRG] Bits */
#define I2C_CPU_INT_RIS_MTXFIFOTRG_OFS           (3)                             /* !< MTXFIFOTRG Offset */
#define I2C_CPU_INT_RIS_MTXFIFOTRG_MASK          ((uint32_t)0x00000008U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_CPU_INT_RIS_MTXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_RIS_MTXFIFOTRG_SET           ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MDMA_DONE_TX] Bits */
#define I2C_CPU_INT_RIS_MDMA_DONE_TX_OFS         (11)                            /* !< MDMA_DONE_TX Offset */
#define I2C_CPU_INT_RIS_MDMA_DONE_TX_MASK        ((uint32_t)0x00000800U)         /* !< DMA Done on Event Channel TX */
#define I2C_CPU_INT_RIS_MDMA_DONE_TX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2C_CPU_INT_RIS_MDMA_DONE_TX_SET         ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[MDMA_DONE_RX] Bits */
#define I2C_CPU_INT_RIS_MDMA_DONE_RX_OFS         (12)                            /* !< MDMA_DONE_RX Offset */
#define I2C_CPU_INT_RIS_MDMA_DONE_RX_MASK        ((uint32_t)0x00001000U)         /* !< DMA Done on Event Channel RX */
#define I2C_CPU_INT_RIS_MDMA_DONE_RX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2C_CPU_INT_RIS_MDMA_DONE_RX_SET         ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[SRXDONE] Bits */
#define I2C_CPU_INT_RIS_SRXDONE_OFS              (16)                            /* !< SRXDONE Offset */
#define I2C_CPU_INT_RIS_SRXDONE_MASK             ((uint32_t)0x00010000U)         /* !< Target Receive Data Interrupt
                                                                                    Signals that a byte has been received */
#define I2C_CPU_INT_RIS_SRXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_SRXDONE_SET              ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[STXDONE] Bits */
#define I2C_CPU_INT_RIS_STXDONE_OFS              (17)                            /* !< STXDONE Offset */
#define I2C_CPU_INT_RIS_STXDONE_MASK             ((uint32_t)0x00020000U)         /* !< Target Transmit Transaction
                                                                                    completed Interrupt */
#define I2C_CPU_INT_RIS_STXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_STXDONE_SET              ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[SGENCALL] Bits */
#define I2C_CPU_INT_RIS_SGENCALL_OFS             (24)                            /* !< SGENCALL Offset */
#define I2C_CPU_INT_RIS_SGENCALL_MASK            ((uint32_t)0x01000000U)         /* !< General Call Interrupt */
#define I2C_CPU_INT_RIS_SGENCALL_CLR             ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_RIS_SGENCALL_SET             ((uint32_t)0x01000000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[STXEMPTY] Bits */
#define I2C_CPU_INT_RIS_STXEMPTY_OFS             (21)                            /* !< STXEMPTY Offset */
#define I2C_CPU_INT_RIS_STXEMPTY_MASK            ((uint32_t)0x00200000U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define I2C_CPU_INT_RIS_STXEMPTY_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_STXEMPTY_SET             ((uint32_t)0x00200000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[SRXFIFOFULL] Bits */
#define I2C_CPU_INT_RIS_SRXFIFOFULL_OFS          (20)                            /* !< SRXFIFOFULL Offset */
#define I2C_CPU_INT_RIS_SRXFIFOFULL_MASK         ((uint32_t)0x00100000U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define I2C_CPU_INT_RIS_SRXFIFOFULL_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_RIS_SRXFIFOFULL_SET          ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[SRXFIFOTRG] Bits */
#define I2C_CPU_INT_RIS_SRXFIFOTRG_OFS           (18)                            /* !< SRXFIFOTRG Offset */
#define I2C_CPU_INT_RIS_SRXFIFOTRG_MASK          ((uint32_t)0x00040000U)         /* !< Target Receive FIFO Trigger */
#define I2C_CPU_INT_RIS_SRXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_RIS_SRXFIFOTRG_SET           ((uint32_t)0x00040000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[STXFIFOTRG] Bits */
#define I2C_CPU_INT_RIS_STXFIFOTRG_OFS           (19)                            /* !< STXFIFOTRG Offset */
#define I2C_CPU_INT_RIS_STXFIFOTRG_MASK          ((uint32_t)0x00080000U)         /* !< Target Transmit FIFO Trigger */
#define I2C_CPU_INT_RIS_STXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_RIS_STXFIFOTRG_SET           ((uint32_t)0x00080000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_RIS[SSTART] Bits */
#define I2C_CPU_INT_RIS_SSTART_OFS               (22)                            /* !< SSTART Offset */
#define I2C_CPU_INT_RIS_SSTART_MASK              ((uint32_t)0x00400000U)         /* !< Start Condition Interrupt */
#define I2C_CPU_INT_RIS_SSTART_CLR               ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define I2C_CPU_INT_RIS_SSTART_SET               ((uint32_t)0x00400000U)         /* !< Set Interrupt */
/* I2C_CPU_INT_RIS[SSTOP] Bits */
#define I2C_CPU_INT_RIS_SSTOP_OFS                (23)                            /* !< SSTOP Offset */
#define I2C_CPU_INT_RIS_SSTOP_MASK               ((uint32_t)0x00800000U)         /* !< Stop Condition Interrupt */
#define I2C_CPU_INT_RIS_SSTOP_CLR                ((uint32_t)0x00000000U)         /* !< Clear Interrupt */
#define I2C_CPU_INT_RIS_SSTOP_SET                ((uint32_t)0x00800000U)         /* !< Set interrupt */
/* I2C_CPU_INT_RIS[SDMA_DONE_TX] Bits */
#define I2C_CPU_INT_RIS_SDMA_DONE_TX_OFS         (25)                            /* !< SDMA_DONE_TX Offset */
#define I2C_CPU_INT_RIS_SDMA_DONE_TX_MASK        ((uint32_t)0x02000000U)         /* !< DMA Done on Event Channel TX */
#define I2C_CPU_INT_RIS_SDMA_DONE_TX_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define I2C_CPU_INT_RIS_SDMA_DONE_TX_SET         ((uint32_t)0x02000000U)         /* !< Set interrupt */
/* I2C_CPU_INT_RIS[SDMA_DONE_RX] Bits */
#define I2C_CPU_INT_RIS_SDMA_DONE_RX_OFS         (26)                            /* !< SDMA_DONE_RX Offset */
#define I2C_CPU_INT_RIS_SDMA_DONE_RX_MASK        ((uint32_t)0x04000000U)         /* !< DMA Done on Event Channel RX */
#define I2C_CPU_INT_RIS_SDMA_DONE_RX_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define I2C_CPU_INT_RIS_SDMA_DONE_RX_SET         ((uint32_t)0x04000000U)         /* !< Set interrupt */
/* I2C_CPU_INT_RIS[MPEC_RX_ERR] Bits */
#define I2C_CPU_INT_RIS_MPEC_RX_ERR_OFS          (13)                            /* !< MPEC_RX_ERR Offset */
#define I2C_CPU_INT_RIS_MPEC_RX_ERR_MASK         ((uint32_t)0x00002000U)         /* !< Controller RX Pec Error Interrupt */
#define I2C_CPU_INT_RIS_MPEC_RX_ERR_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_MPEC_RX_ERR_SET          ((uint32_t)0x00002000U)         /* !< Interrupt Occured */
/* I2C_CPU_INT_RIS[TIMEOUTB] Bits */
#define I2C_CPU_INT_RIS_TIMEOUTB_OFS             (15)                            /* !< TIMEOUTB Offset */
#define I2C_CPU_INT_RIS_TIMEOUTB_MASK            ((uint32_t)0x00008000U)         /* !< Timeout B Interrupt */
#define I2C_CPU_INT_RIS_TIMEOUTB_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_TIMEOUTB_SET             ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* I2C_CPU_INT_RIS[SPEC_RX_ERR] Bits */
#define I2C_CPU_INT_RIS_SPEC_RX_ERR_OFS          (27)                            /* !< SPEC_RX_ERR Offset */
#define I2C_CPU_INT_RIS_SPEC_RX_ERR_MASK         ((uint32_t)0x08000000U)         /* !< Target RX Pec Error Interrupt */
#define I2C_CPU_INT_RIS_SPEC_RX_ERR_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_SPEC_RX_ERR_SET          ((uint32_t)0x08000000U)         /* !< Interrupt ocuured */
/* I2C_CPU_INT_RIS[STX_UNFL] Bits */
#define I2C_CPU_INT_RIS_STX_UNFL_OFS             (28)                            /* !< STX_UNFL Offset */
#define I2C_CPU_INT_RIS_STX_UNFL_MASK            ((uint32_t)0x10000000U)         /* !< Target TX FIFO underflow */
#define I2C_CPU_INT_RIS_STX_UNFL_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_STX_UNFL_SET             ((uint32_t)0x10000000U)         /* !< Interrupt occured */
/* I2C_CPU_INT_RIS[SRX_OVFL] Bits */
#define I2C_CPU_INT_RIS_SRX_OVFL_OFS             (29)                            /* !< SRX_OVFL Offset */
#define I2C_CPU_INT_RIS_SRX_OVFL_MASK            ((uint32_t)0x20000000U)         /* !< Target RX FIFO overflow */
#define I2C_CPU_INT_RIS_SRX_OVFL_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_SRX_OVFL_SET             ((uint32_t)0x20000000U)         /* !< Interrupt Occured */
/* I2C_CPU_INT_RIS[SARBLOST] Bits */
#define I2C_CPU_INT_RIS_SARBLOST_OFS             (30)                            /* !< SARBLOST Offset */
#define I2C_CPU_INT_RIS_SARBLOST_MASK            ((uint32_t)0x40000000U)         /* !< Target Arbitration Lost */
#define I2C_CPU_INT_RIS_SARBLOST_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_SARBLOST_SET             ((uint32_t)0x40000000U)         /* !< Interrupt occured */
/* I2C_CPU_INT_RIS[INTR_OVFL] Bits */
#define I2C_CPU_INT_RIS_INTR_OVFL_OFS            (31)                            /* !< INTR_OVFL Offset */
#define I2C_CPU_INT_RIS_INTR_OVFL_MASK           ((uint32_t)0x80000000U)         /* !< Interrupt overflow interrupt It is
                                                                                    set when SSTART or SSTOP interrupts
                                                                                    overflow i.e. occur twice without
                                                                                    being serviced */
#define I2C_CPU_INT_RIS_INTR_OVFL_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_RIS_INTR_OVFL_SET            ((uint32_t)0x80000000U)         /* !< Interrupt occured */

