sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_CPU_INT_MIS Bits */
/* I2C_CPU_INT_MIS[MRXDONE] Bits */
#define I2C_CPU_INT_MIS_MRXDONE_OFS              (0)                             /* !< MRXDONE Offset */
#define I2C_CPU_INT_MIS_MRXDONE_MASK             ((uint32_t)0x00000001U)         /* !< Controller Receive Data Interrupt */
#define I2C_CPU_INT_MIS_MRXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MRXDONE_SET              ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[TIMEOUTA] Bits */
#define I2C_CPU_INT_MIS_TIMEOUTA_OFS             (14)                            /* !< TIMEOUTA Offset */
#define I2C_CPU_INT_MIS_TIMEOUTA_MASK            ((uint32_t)0x00004000U)         /* !< Timeout A Interrupt */
#define I2C_CPU_INT_MIS_TIMEOUTA_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_TIMEOUTA_SET             ((uint32_t)0x00004000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MNACK] Bits */
#define I2C_CPU_INT_MIS_MNACK_OFS                (7)                             /* !< MNACK Offset */
#define I2C_CPU_INT_MIS_MNACK_MASK               ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt */
#define I2C_CPU_INT_MIS_MNACK_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MNACK_SET                ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MSTART] Bits */
#define I2C_CPU_INT_MIS_MSTART_OFS               (8)                             /* !< MSTART Offset */
#define I2C_CPU_INT_MIS_MSTART_MASK              ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define I2C_CPU_INT_MIS_MSTART_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MSTART_SET               ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MSTOP] Bits */
#define I2C_CPU_INT_MIS_MSTOP_OFS                (9)                             /* !< MSTOP Offset */
#define I2C_CPU_INT_MIS_MSTOP_MASK               ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define I2C_CPU_INT_MIS_MSTOP_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MSTOP_SET                ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MARBLOST] Bits */
#define I2C_CPU_INT_MIS_MARBLOST_OFS             (10)                            /* !< MARBLOST Offset */
#define I2C_CPU_INT_MIS_MARBLOST_MASK            ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt */
#define I2C_CPU_INT_MIS_MARBLOST_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MARBLOST_SET             ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MTXDONE] Bits */
#define I2C_CPU_INT_MIS_MTXDONE_OFS              (1)                             /* !< MTXDONE Offset */
#define I2C_CPU_INT_MIS_MTXDONE_MASK             ((uint32_t)0x00000002U)         /* !< Controller Transmit Transaction
                                                                                    completed Interrupt */
#define I2C_CPU_INT_MIS_MTXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MTXDONE_SET              ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MRXFIFOFULL] Bits */
#define I2C_CPU_INT_MIS_MRXFIFOFULL_OFS          (4)                             /* !< MRXFIFOFULL Offset */
#define I2C_CPU_INT_MIS_MRXFIFOFULL_MASK         ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if the RX FIFO is full. */
#define I2C_CPU_INT_MIS_MRXFIFOFULL_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MRXFIFOFULL_SET          ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MTXEMPTY] Bits */
#define I2C_CPU_INT_MIS_MTXEMPTY_OFS             (5)                             /* !< MTXEMPTY Offset */
#define I2C_CPU_INT_MIS_MTXEMPTY_MASK            ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define I2C_CPU_INT_MIS_MTXEMPTY_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_MTXEMPTY_SET             ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MRXFIFOTRG] Bits */
#define I2C_CPU_INT_MIS_MRXFIFOTRG_OFS           (2)                             /* !< MRXFIFOTRG Offset */
#define I2C_CPU_INT_MIS_MRXFIFOTRG_MASK          ((uint32_t)0x00000004U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_CPU_INT_MIS_MRXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_MIS_MRXFIFOTRG_SET           ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MTXFIFOTRG] Bits */
#define I2C_CPU_INT_MIS_MTXFIFOTRG_OFS           (3)                             /* !< MTXFIFOTRG Offset */
#define I2C_CPU_INT_MIS_MTXFIFOTRG_MASK          ((uint32_t)0x00000008U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_CPU_INT_MIS_MTXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_MIS_MTXFIFOTRG_SET           ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MDMA_DONE_TX] Bits */
#define I2C_CPU_INT_MIS_MDMA_DONE_TX_OFS         (11)                            /* !< MDMA_DONE_TX Offset */
#define I2C_CPU_INT_MIS_MDMA_DONE_TX_MASK        ((uint32_t)0x00000800U)         /* !< DMA Done on Event Channel TX */
#define I2C_CPU_INT_MIS_MDMA_DONE_TX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2C_CPU_INT_MIS_MDMA_DONE_TX_SET         ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[MDMA_DONE_RX] Bits */
#define I2C_CPU_INT_MIS_MDMA_DONE_RX_OFS         (12)                            /* !< MDMA_DONE_RX Offset */
#define I2C_CPU_INT_MIS_MDMA_DONE_RX_MASK        ((uint32_t)0x00001000U)         /* !< DMA Done on Event Channel RX */
#define I2C_CPU_INT_MIS_MDMA_DONE_RX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2C_CPU_INT_MIS_MDMA_DONE_RX_SET         ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[SRXDONE] Bits */
#define I2C_CPU_INT_MIS_SRXDONE_OFS              (16)                            /* !< SRXDONE Offset */
#define I2C_CPU_INT_MIS_SRXDONE_MASK             ((uint32_t)0x00010000U)         /* !< Target Receive Data Interrupt
                                                                                    Signals that a byte has been received */
#define I2C_CPU_INT_MIS_SRXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_SRXDONE_SET              ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[STXDONE] Bits */
#define I2C_CPU_INT_MIS_STXDONE_OFS              (17)                            /* !< STXDONE Offset */
#define I2C_CPU_INT_MIS_STXDONE_MASK             ((uint32_t)0x00020000U)         /* !< Target Transmit Transaction
                                                                                    completed Interrupt */
#define I2C_CPU_INT_MIS_STXDONE_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_STXDONE_SET              ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[SGENCALL] Bits */
#define I2C_CPU_INT_MIS_SGENCALL_OFS             (24)                            /* !< SGENCALL Offset */
#define I2C_CPU_INT_MIS_SGENCALL_MASK            ((uint32_t)0x01000000U)         /* !< General Call Interrupt */
#define I2C_CPU_INT_MIS_SGENCALL_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_SGENCALL_SET             ((uint32_t)0x01000000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[STXEMPTY] Bits */
#define I2C_CPU_INT_MIS_STXEMPTY_OFS             (21)                            /* !< STXEMPTY Offset */
#define I2C_CPU_INT_MIS_STXEMPTY_MASK            ((uint32_t)0x00200000U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define I2C_CPU_INT_MIS_STXEMPTY_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_STXEMPTY_SET             ((uint32_t)0x00200000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[SRXFIFOFULL] Bits */
#define I2C_CPU_INT_MIS_SRXFIFOFULL_OFS          (20)                            /* !< SRXFIFOFULL Offset */
#define I2C_CPU_INT_MIS_SRXFIFOFULL_MASK         ((uint32_t)0x00100000U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define I2C_CPU_INT_MIS_SRXFIFOFULL_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_MIS_SRXFIFOFULL_SET          ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[SRXFIFOTRG] Bits */
#define I2C_CPU_INT_MIS_SRXFIFOTRG_OFS           (18)                            /* !< SRXFIFOTRG Offset */
#define I2C_CPU_INT_MIS_SRXFIFOTRG_MASK          ((uint32_t)0x00040000U)         /* !< Target Receive FIFO Trigger */
#define I2C_CPU_INT_MIS_SRXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_MIS_SRXFIFOTRG_SET           ((uint32_t)0x00040000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[STXFIFOTRG] Bits */
#define I2C_CPU_INT_MIS_STXFIFOTRG_OFS           (19)                            /* !< STXFIFOTRG Offset */
#define I2C_CPU_INT_MIS_STXFIFOTRG_MASK          ((uint32_t)0x00080000U)         /* !< Target Transmit FIFO Trigger */
#define I2C_CPU_INT_MIS_STXFIFOTRG_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_MIS_STXFIFOTRG_SET           ((uint32_t)0x00080000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_MIS[SSTART] Bits */
#define I2C_CPU_INT_MIS_SSTART_OFS               (22)                            /* !< SSTART Offset */
#define I2C_CPU_INT_MIS_SSTART_MASK              ((uint32_t)0x00400000U)         /* !< Target START Detection Interrupt */
#define I2C_CPU_INT_MIS_SSTART_CLR               ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define I2C_CPU_INT_MIS_SSTART_SET               ((uint32_t)0x00400000U)         /* !< Set MIS */
/* I2C_CPU_INT_MIS[SSTOP] Bits */
#define I2C_CPU_INT_MIS_SSTOP_OFS                (23)                            /* !< SSTOP Offset */
#define I2C_CPU_INT_MIS_SSTOP_MASK               ((uint32_t)0x00800000U)         /* !< Target STOP Detection Interrupt */
#define I2C_CPU_INT_MIS_SSTOP_CLR                ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define I2C_CPU_INT_MIS_SSTOP_SET                ((uint32_t)0x00800000U)         /* !< Set MIS */
/* I2C_CPU_INT_MIS[SDMA_DONE_TX] Bits */
#define I2C_CPU_INT_MIS_SDMA_DONE_TX_OFS         (25)                            /* !< SDMA_DONE_TX Offset */
#define I2C_CPU_INT_MIS_SDMA_DONE_TX_MASK        ((uint32_t)0x02000000U)         /* !< DMA Done on Event Channel TX */
#define I2C_CPU_INT_MIS_SDMA_DONE_TX_CLR         ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define I2C_CPU_INT_MIS_SDMA_DONE_TX_SET         ((uint32_t)0x02000000U)         /* !< Set MIS */
/* I2C_CPU_INT_MIS[SDMA_DONE_RX] Bits */
#define I2C_CPU_INT_MIS_SDMA_DONE_RX_OFS         (26)                            /* !< SDMA_DONE_RX Offset */
#define I2C_CPU_INT_MIS_SDMA_DONE_RX_MASK        ((uint32_t)0x04000000U)         /* !< DMA Done on Event Channel RX */
#define I2C_CPU_INT_MIS_SDMA_DONE_RX_CLR         ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define I2C_CPU_INT_MIS_SDMA_DONE_RX_SET         ((uint32_t)0x04000000U)         /* !< Set MIS */
/* I2C_CPU_INT_MIS[MPEC_RX_ERR] Bits */
#define I2C_CPU_INT_MIS_MPEC_RX_ERR_OFS          (13)                            /* !< MPEC_RX_ERR Offset */
#define I2C_CPU_INT_MIS_MPEC_RX_ERR_MASK         ((uint32_t)0x00002000U)         /* !< Controller RX Pec Error Interrupt */
#define I2C_CPU_INT_MIS_MPEC_RX_ERR_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define I2C_CPU_INT_MIS_MPEC_RX_ERR_SET          ((uint32_t)0x00002000U)         /* !< Set interrupt mask */
/* I2C_CPU_INT_MIS[TIMEOUTB] Bits */
#define I2C_CPU_INT_MIS_TIMEOUTB_OFS             (15)                            /* !< TIMEOUTB Offset */
#define I2C_CPU_INT_MIS_TIMEOUTB_MASK            ((uint32_t)0x00008000U)         /* !< Timeout B Interrupt */
#define I2C_CPU_INT_MIS_TIMEOUTB_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define I2C_CPU_INT_MIS_TIMEOUTB_SET             ((uint32_t)0x00008000U)         /* !< Set interrupt mask */
/* I2C_CPU_INT_MIS[SPEC_RX_ERR] Bits */
#define I2C_CPU_INT_MIS_SPEC_RX_ERR_OFS          (27)                            /* !< SPEC_RX_ERR Offset */
#define I2C_CPU_INT_MIS_SPEC_RX_ERR_MASK         ((uint32_t)0x08000000U)         /* !< Target RX Pec Error Interrupt */
#define I2C_CPU_INT_MIS_SPEC_RX_ERR_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define I2C_CPU_INT_MIS_SPEC_RX_ERR_SET          ((uint32_t)0x08000000U)         /* !< Set interrupt mask */
/* I2C_CPU_INT_MIS[STX_UNFL] Bits */
#define I2C_CPU_INT_MIS_STX_UNFL_OFS             (28)                            /* !< STX_UNFL Offset */
#define I2C_CPU_INT_MIS_STX_UNFL_MASK            ((uint32_t)0x10000000U)         /* !< Target TX FIFO underflow */
#define I2C_CPU_INT_MIS_STX_UNFL_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define I2C_CPU_INT_MIS_STX_UNFL_SET             ((uint32_t)0x10000000U)         /* !< Set interrupt mask */
/* I2C_CPU_INT_MIS[SRX_OVFL] Bits */
#define I2C_CPU_INT_MIS_SRX_OVFL_OFS             (29)                            /* !< SRX_OVFL Offset */
#define I2C_CPU_INT_MIS_SRX_OVFL_MASK            ((uint32_t)0x20000000U)         /* !< Target RX FIFO overflow */
#define I2C_CPU_INT_MIS_SRX_OVFL_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define I2C_CPU_INT_MIS_SRX_OVFL_SET             ((uint32_t)0x20000000U)         /* !< Set interrupt mask */
/* I2C_CPU_INT_MIS[SARBLOST] Bits */
#define I2C_CPU_INT_MIS_SARBLOST_OFS             (30)                            /* !< SARBLOST Offset */
#define I2C_CPU_INT_MIS_SARBLOST_MASK            ((uint32_t)0x40000000U)         /* !< Target Arbitration Lost */
#define I2C_CPU_INT_MIS_SARBLOST_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define I2C_CPU_INT_MIS_SARBLOST_SET             ((uint32_t)0x40000000U)         /* !< Set interrupt mask */
/* I2C_CPU_INT_MIS[INTR_OVFL] Bits */
#define I2C_CPU_INT_MIS_INTR_OVFL_OFS            (31)                            /* !< INTR_OVFL Offset */
#define I2C_CPU_INT_MIS_INTR_OVFL_MASK           ((uint32_t)0x80000000U)         /* !< Interrupt overflow */
#define I2C_CPU_INT_MIS_INTR_OVFL_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2C_CPU_INT_MIS_INTR_OVFL_SET            ((uint32_t)0x80000000U)         /* !< Interrupt occured */

