sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_CPU_INT_ICLR Bits */
/* I2C_CPU_INT_ICLR[MRXDONE] Bits */
#define I2C_CPU_INT_ICLR_MRXDONE_OFS             (0)                             /* !< MRXDONE Offset */
#define I2C_CPU_INT_ICLR_MRXDONE_MASK            ((uint32_t)0x00000001U)         /* !< Controller Receive Data Interrupt
                                                                                    Signals that a byte has been received */
#define I2C_CPU_INT_ICLR_MRXDONE_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MRXDONE_CLR             ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[TIMEOUTA] Bits */
#define I2C_CPU_INT_ICLR_TIMEOUTA_OFS            (14)                            /* !< TIMEOUTA Offset */
#define I2C_CPU_INT_ICLR_TIMEOUTA_MASK           ((uint32_t)0x00004000U)         /* !< Timeout A interrupt */
#define I2C_CPU_INT_ICLR_TIMEOUTA_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_TIMEOUTA_CLR            ((uint32_t)0x00004000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MNACK] Bits */
#define I2C_CPU_INT_ICLR_MNACK_OFS               (7)                             /* !< MNACK Offset */
#define I2C_CPU_INT_ICLR_MNACK_MASK              ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt */
#define I2C_CPU_INT_ICLR_MNACK_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MNACK_CLR               ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MSTART] Bits */
#define I2C_CPU_INT_ICLR_MSTART_OFS              (8)                             /* !< MSTART Offset */
#define I2C_CPU_INT_ICLR_MSTART_MASK             ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define I2C_CPU_INT_ICLR_MSTART_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MSTART_CLR              ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MSTOP] Bits */
#define I2C_CPU_INT_ICLR_MSTOP_OFS               (9)                             /* !< MSTOP Offset */
#define I2C_CPU_INT_ICLR_MSTOP_MASK              ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define I2C_CPU_INT_ICLR_MSTOP_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MSTOP_CLR               ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MARBLOST] Bits */
#define I2C_CPU_INT_ICLR_MARBLOST_OFS            (10)                            /* !< MARBLOST Offset */
#define I2C_CPU_INT_ICLR_MARBLOST_MASK           ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt */
#define I2C_CPU_INT_ICLR_MARBLOST_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MARBLOST_CLR            ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MTXDONE] Bits */
#define I2C_CPU_INT_ICLR_MTXDONE_OFS             (1)                             /* !< MTXDONE Offset */
#define I2C_CPU_INT_ICLR_MTXDONE_MASK            ((uint32_t)0x00000002U)         /* !< Controller Transmit Transaction
                                                                                    completed Interrupt */
#define I2C_CPU_INT_ICLR_MTXDONE_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MTXDONE_CLR             ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MRXFIFOFULL] Bits */
#define I2C_CPU_INT_ICLR_MRXFIFOFULL_OFS         (4)                             /* !< MRXFIFOFULL Offset */
#define I2C_CPU_INT_ICLR_MRXFIFOFULL_MASK        ((uint32_t)0x00000010U)         /* !< RXFIFO full event. */
#define I2C_CPU_INT_ICLR_MRXFIFOFULL_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MRXFIFOFULL_CLR         ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MTXEMPTY] Bits */
#define I2C_CPU_INT_ICLR_MTXEMPTY_OFS            (5)                             /* !< MTXEMPTY Offset */
#define I2C_CPU_INT_ICLR_MTXEMPTY_MASK           ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define I2C_CPU_INT_ICLR_MTXEMPTY_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MTXEMPTY_CLR            ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MRXFIFOTRG] Bits */
#define I2C_CPU_INT_ICLR_MRXFIFOTRG_OFS          (2)                             /* !< MRXFIFOTRG Offset */
#define I2C_CPU_INT_ICLR_MRXFIFOTRG_MASK         ((uint32_t)0x00000004U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_CPU_INT_ICLR_MRXFIFOTRG_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_ICLR_MRXFIFOTRG_CLR          ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MTXFIFOTRG] Bits */
#define I2C_CPU_INT_ICLR_MTXFIFOTRG_OFS          (3)                             /* !< MTXFIFOTRG Offset */
#define I2C_CPU_INT_ICLR_MTXFIFOTRG_MASK         ((uint32_t)0x00000008U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_CPU_INT_ICLR_MTXFIFOTRG_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_ICLR_MTXFIFOTRG_CLR          ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MDMA_DONE_TX] Bits */
#define I2C_CPU_INT_ICLR_MDMA_DONE_TX_OFS        (11)                            /* !< MDMA_DONE_TX Offset */
#define I2C_CPU_INT_ICLR_MDMA_DONE_TX_MASK       ((uint32_t)0x00000800U)         /* !< DMA Done on Event Channel TX */
#define I2C_CPU_INT_ICLR_MDMA_DONE_TX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2C_CPU_INT_ICLR_MDMA_DONE_TX_CLR        ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[MDMA_DONE_RX] Bits */
#define I2C_CPU_INT_ICLR_MDMA_DONE_RX_OFS        (12)                            /* !< MDMA_DONE_RX Offset */
#define I2C_CPU_INT_ICLR_MDMA_DONE_RX_MASK       ((uint32_t)0x00001000U)         /* !< DMA Done on Event Channel RX */
#define I2C_CPU_INT_ICLR_MDMA_DONE_RX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2C_CPU_INT_ICLR_MDMA_DONE_RX_CLR        ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[SRXDONE] Bits */
#define I2C_CPU_INT_ICLR_SRXDONE_OFS             (16)                            /* !< SRXDONE Offset */
#define I2C_CPU_INT_ICLR_SRXDONE_MASK            ((uint32_t)0x00010000U)         /* !< Target Receive Data Interrupt
                                                                                    Signals that a byte has been received */
#define I2C_CPU_INT_ICLR_SRXDONE_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SRXDONE_CLR             ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[STXDONE] Bits */
#define I2C_CPU_INT_ICLR_STXDONE_OFS             (17)                            /* !< STXDONE Offset */
#define I2C_CPU_INT_ICLR_STXDONE_MASK            ((uint32_t)0x00020000U)         /* !< Target Transmit Transaction
                                                                                    completed Interrupt */
#define I2C_CPU_INT_ICLR_STXDONE_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_STXDONE_CLR             ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[SGENCALL] Bits */
#define I2C_CPU_INT_ICLR_SGENCALL_OFS            (24)                            /* !< SGENCALL Offset */
#define I2C_CPU_INT_ICLR_SGENCALL_MASK           ((uint32_t)0x01000000U)         /* !< General Call Interrupt */
#define I2C_CPU_INT_ICLR_SGENCALL_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SGENCALL_CLR            ((uint32_t)0x01000000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[STXEMPTY] Bits */
#define I2C_CPU_INT_ICLR_STXEMPTY_OFS            (21)                            /* !< STXEMPTY Offset */
#define I2C_CPU_INT_ICLR_STXEMPTY_MASK           ((uint32_t)0x00200000U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define I2C_CPU_INT_ICLR_STXEMPTY_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_STXEMPTY_CLR            ((uint32_t)0x00200000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[SRXFIFOFULL] Bits */
#define I2C_CPU_INT_ICLR_SRXFIFOFULL_OFS         (20)                            /* !< SRXFIFOFULL Offset */
#define I2C_CPU_INT_ICLR_SRXFIFOFULL_MASK        ((uint32_t)0x00100000U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define I2C_CPU_INT_ICLR_SRXFIFOFULL_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_ICLR_SRXFIFOFULL_CLR         ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[SRXFIFOTRG] Bits */
#define I2C_CPU_INT_ICLR_SRXFIFOTRG_OFS          (18)                            /* !< SRXFIFOTRG Offset */
#define I2C_CPU_INT_ICLR_SRXFIFOTRG_MASK         ((uint32_t)0x00040000U)         /* !< Target Receive FIFO Trigger */
#define I2C_CPU_INT_ICLR_SRXFIFOTRG_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_ICLR_SRXFIFOTRG_CLR          ((uint32_t)0x00040000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[STXFIFOTRG] Bits */
#define I2C_CPU_INT_ICLR_STXFIFOTRG_OFS          (19)                            /* !< STXFIFOTRG Offset */
#define I2C_CPU_INT_ICLR_STXFIFOTRG_MASK         ((uint32_t)0x00080000U)         /* !< Target Transmit FIFO Trigger */
#define I2C_CPU_INT_ICLR_STXFIFOTRG_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_CPU_INT_ICLR_STXFIFOTRG_CLR          ((uint32_t)0x00080000U)         /* !< Set Interrupt Mask */
/* I2C_CPU_INT_ICLR[SSTART] Bits */
#define I2C_CPU_INT_ICLR_SSTART_OFS              (22)                            /* !< SSTART Offset */
#define I2C_CPU_INT_ICLR_SSTART_MASK             ((uint32_t)0x00400000U)         /* !< Target START Detection Interrupt */
#define I2C_CPU_INT_ICLR_SSTART_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SSTART_CLR              ((uint32_t)0x00400000U)         /* !< Clear interrupt */
/* I2C_CPU_INT_ICLR[SSTOP] Bits */
#define I2C_CPU_INT_ICLR_SSTOP_OFS               (23)                            /* !< SSTOP Offset */
#define I2C_CPU_INT_ICLR_SSTOP_MASK              ((uint32_t)0x00800000U)         /* !< Target STOP Detection Interrupt */
#define I2C_CPU_INT_ICLR_SSTOP_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SSTOP_CLR               ((uint32_t)0x00800000U)         /* !< Clear interrupt */
/* I2C_CPU_INT_ICLR[SDMA_DONE_TX] Bits */
#define I2C_CPU_INT_ICLR_SDMA_DONE_TX_OFS        (25)                            /* !< SDMA_DONE_TX Offset */
#define I2C_CPU_INT_ICLR_SDMA_DONE_TX_MASK       ((uint32_t)0x02000000U)         /* !< DMA Done on Event Channel TX */
#define I2C_CPU_INT_ICLR_SDMA_DONE_TX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SDMA_DONE_TX_CLR        ((uint32_t)0x02000000U)         /* !< Clear interrupt */
/* I2C_CPU_INT_ICLR[SDMA_DONE_RX] Bits */
#define I2C_CPU_INT_ICLR_SDMA_DONE_RX_OFS        (26)                            /* !< SDMA_DONE_RX Offset */
#define I2C_CPU_INT_ICLR_SDMA_DONE_RX_MASK       ((uint32_t)0x04000000U)         /* !< DMA Done on Event Channel RX */
#define I2C_CPU_INT_ICLR_SDMA_DONE_RX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SDMA_DONE_RX_CLR        ((uint32_t)0x04000000U)         /* !< Clear interrupt */
/* I2C_CPU_INT_ICLR[MPEC_RX_ERR] Bits */
#define I2C_CPU_INT_ICLR_MPEC_RX_ERR_OFS         (13)                            /* !< MPEC_RX_ERR Offset */
#define I2C_CPU_INT_ICLR_MPEC_RX_ERR_MASK        ((uint32_t)0x00002000U)         /* !< Controller RX Pec Error Interrupt */
#define I2C_CPU_INT_ICLR_MPEC_RX_ERR_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_MPEC_RX_ERR_CLR         ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* I2C_CPU_INT_ICLR[TIMEOUTB] Bits */
#define I2C_CPU_INT_ICLR_TIMEOUTB_OFS            (15)                            /* !< TIMEOUTB Offset */
#define I2C_CPU_INT_ICLR_TIMEOUTB_MASK           ((uint32_t)0x00008000U)         /* !< Timeout B Interrupt */
#define I2C_CPU_INT_ICLR_TIMEOUTB_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_TIMEOUTB_CLR            ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* I2C_CPU_INT_ICLR[SPEC_RX_ERR] Bits */
#define I2C_CPU_INT_ICLR_SPEC_RX_ERR_OFS         (27)                            /* !< SPEC_RX_ERR Offset */
#define I2C_CPU_INT_ICLR_SPEC_RX_ERR_MASK        ((uint32_t)0x08000000U)         /* !< Target RX Pec Error Interrupt */
#define I2C_CPU_INT_ICLR_SPEC_RX_ERR_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SPEC_RX_ERR_CLR         ((uint32_t)0x08000000U)         /* !< Clear Interrupt */
/* I2C_CPU_INT_ICLR[STX_UNFL] Bits */
#define I2C_CPU_INT_ICLR_STX_UNFL_OFS            (28)                            /* !< STX_UNFL Offset */
#define I2C_CPU_INT_ICLR_STX_UNFL_MASK           ((uint32_t)0x10000000U)         /* !< Target TX FIFO underflow */
#define I2C_CPU_INT_ICLR_STX_UNFL_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_STX_UNFL_CLR            ((uint32_t)0x10000000U)         /* !< Clear Interrupt */
/* I2C_CPU_INT_ICLR[SRX_OVFL] Bits */
#define I2C_CPU_INT_ICLR_SRX_OVFL_OFS            (29)                            /* !< SRX_OVFL Offset */
#define I2C_CPU_INT_ICLR_SRX_OVFL_MASK           ((uint32_t)0x20000000U)         /* !< Target RX FIFO overflow */
#define I2C_CPU_INT_ICLR_SRX_OVFL_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SRX_OVFL_CLR            ((uint32_t)0x20000000U)         /* !< Clear Interrupt */
/* I2C_CPU_INT_ICLR[SARBLOST] Bits */
#define I2C_CPU_INT_ICLR_SARBLOST_OFS            (30)                            /* !< SARBLOST Offset */
#define I2C_CPU_INT_ICLR_SARBLOST_MASK           ((uint32_t)0x40000000U)         /* !< Target Arbitration Lost */
#define I2C_CPU_INT_ICLR_SARBLOST_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_CPU_INT_ICLR_SARBLOST_CLR            ((uint32_t)0x40000000U)         /* !< Clear Interrupt */
/* I2C_CPU_INT_ICLR[INTR_OVFL] Bits */
#define I2C_CPU_INT_ICLR_INTR_OVFL_OFS           (31)                            /* !< INTR_OVFL Offset */
#define I2C_CPU_INT_ICLR_INTR_OVFL_MASK          ((uint32_t)0x80000000U)         /* !< Interrupt overflow */
#define I2C_CPU_INT_ICLR_INTR_OVFL_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< No effect */
#define I2C_CPU_INT_ICLR_INTR_OVFL_CLR           ((uint32_t)0x80000000U)         /* !< Clear interrupt */

/* I2C_PWREN Bits */
/* I2C_PWREN[ENABLE] Bits */
#define I2C_PWREN_ENABLE_OFS                     (0)                             /* !< ENABLE Offset */
#define I2C_PWREN_ENABLE_MASK                    ((uint32_t)0x00000001U)         /* !< Enable the power */
#define I2C_PWREN_ENABLE_DISABLE                 ((uint32_t)0x00000000U)         /* !< Disable Power */
#define I2C_PWREN_ENABLE_ENABLE                  ((uint32_t)0x00000001U)         /* !< Enable Power */
/* I2C_PWREN[KEY] Bits */
#define I2C_PWREN_KEY_OFS                        (24)                            /* !< KEY Offset */
#define I2C_PWREN_KEY_MASK                       ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define I2C_PWREN_KEY_UNLOCK_W                   ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* I2C_RSTCTL Bits */
/* I2C_RSTCTL[RESETSTKYCLR] Bits */
#define I2C_RSTCTL_RESETSTKYCLR_OFS              (1)                             /* !< RESETSTKYCLR Offset */
#define I2C_RSTCTL_RESETSTKYCLR_MASK             ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define I2C_RSTCTL_RESETSTKYCLR_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_RSTCTL_RESETSTKYCLR_CLR              ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* I2C_RSTCTL[RESETASSERT] Bits */
#define I2C_RSTCTL_RESETASSERT_OFS               (0)                             /* !< RESETASSERT Offset */
#define I2C_RSTCTL_RESETASSERT_MASK              ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define I2C_RSTCTL_RESETASSERT_NOP               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2C_RSTCTL_RESETASSERT_ASSERT            ((uint32_t)0x00000001U)         /* !< Assert reset */
/* I2C_RSTCTL[KEY] Bits */
#define I2C_RSTCTL_KEY_OFS                       (24)                            /* !< KEY Offset */
#define I2C_RSTCTL_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define I2C_RSTCTL_KEY_UNLOCK_W                  ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* I2C_CLKCFG Bits */
/* I2C_CLKCFG[KEY] Bits */
#define I2C_CLKCFG_KEY_OFS                       (24)                            /* !< KEY Offset */
#define I2C_CLKCFG_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define I2C_CLKCFG_KEY_UNLOCK                    ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* I2C_CLKCFG[BLOCKASYNC] Bits */
#define I2C_CLKCFG_BLOCKASYNC_OFS                (8)                             /* !< BLOCKASYNC Offset */
#define I2C_CLKCFG_BLOCKASYNC_MASK               ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define I2C_CLKCFG_BLOCKASYNC_DISABLE            ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define I2C_CLKCFG_BLOCKASYNC_ENABLE             ((uint32_t)0x00000100U)         /* !< Block async clock request */

