sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_INTCTL Bits */
/* I2C_INTCTL[INTEVAL] Bits */
#define I2C_INTCTL_INTEVAL_OFS                   (0)                             /* !< INTEVAL Offset */
#define I2C_INTCTL_INTEVAL_MASK                  ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define I2C_INTCTL_INTEVAL_DISABLE               ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define I2C_INTCTL_INTEVAL_EVAL                  ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* I2C_DESC Bits */
/* I2C_DESC[MINREV] Bits */
#define I2C_DESC_MINREV_OFS                      (0)                             /* !< MINREV Offset */
#define I2C_DESC_MINREV_MASK                     ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define I2C_DESC_MINREV_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_DESC_MINREV_MAXIMUM                  ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* I2C_DESC[MAJREV] Bits */
#define I2C_DESC_MAJREV_OFS                      (4)                             /* !< MAJREV Offset */
#define I2C_DESC_MAJREV_MASK                     ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define I2C_DESC_MAJREV_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_DESC_MAJREV_MAXIMUM                  ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* I2C_DESC[INSTNUM] Bits */
#define I2C_DESC_INSTNUM_OFS                     (8)                             /* !< INSTNUM Offset */
#define I2C_DESC_INSTNUM_MASK                    ((uint32_t)0x00000F00U)         /* !< Instance Number within the device.
                                                                                    This will be a parameter to the RTL
                                                                                    for modules that can have multiple
                                                                                    instances */
#define I2C_DESC_INSTNUM_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_DESC_INSTNUM_MAXIMUM                 ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* I2C_DESC[FEATUREVER] Bits */
#define I2C_DESC_FEATUREVER_OFS                  (12)                            /* !< FEATUREVER Offset */
#define I2C_DESC_FEATUREVER_MASK                 ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define I2C_DESC_FEATUREVER_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_DESC_FEATUREVER_MAXIMUM              ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* I2C_DESC[MODULEID] Bits */
#define I2C_DESC_MODULEID_OFS                    (16)                            /* !< MODULEID Offset */
#define I2C_DESC_MODULEID_MASK                   ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define I2C_DESC_MODULEID_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_DESC_MODULEID_MAXIMUM                ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* I2C_GFCTL Bits */
/* I2C_GFCTL[AGFSEL] Bits */
#define I2C_GFCTL_AGFSEL_OFS                     (9)                             /* !< AGFSEL Offset */
#define I2C_GFCTL_AGFSEL_MASK                    ((uint32_t)0x00000600U)         /* !< Analog Glitch Suppression Pulse
                                                                                    Width This field controls the pulse
                                                                                    width select for the analog glitch
                                                                                    suppression on SCL and SDA lines.
                                                                                    See device datasheet for exact
                                                                                    values. (ULP I2C only) */
#define I2C_GFCTL_AGFSEL_AGLIT_5                 ((uint32_t)0x00000000U)         /* !< Pulses shorter then 5ns length are
                                                                                    filtered. */
#define I2C_GFCTL_AGFSEL_AGLIT_10                ((uint32_t)0x00000200U)         /* !< Pulses shorter then 10ns length are
                                                                                    filtered. */
#define I2C_GFCTL_AGFSEL_AGLIT_25                ((uint32_t)0x00000400U)         /* !< Pulses shorter then 25ns length are
                                                                                    filtered. */
#define I2C_GFCTL_AGFSEL_AGLIT_50                ((uint32_t)0x00000600U)         /* !< Pulses shorter then 50ns length are
                                                                                    filtered. */
/* I2C_GFCTL[DGFSEL] Bits */
#define I2C_GFCTL_DGFSEL_OFS                     (0)                             /* !< DGFSEL Offset */
#define I2C_GFCTL_DGFSEL_MASK                    ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width
                                                                                    This field controls the pulse width
                                                                                    select for glitch suppression on the
                                                                                    SCL and SDA lines. The following
                                                                                    values are the glitch suppression
                                                                                    values in terms of functional clocks.
                                                                                    (Core Domain only) */
#define I2C_GFCTL_DGFSEL_DISABLED                ((uint32_t)0x00000000U)         /* !< Bypass */
#define I2C_GFCTL_DGFSEL_CLK_1                   ((uint32_t)0x00000001U)         /* !< 1 clock */
#define I2C_GFCTL_DGFSEL_CLK_2                   ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define I2C_GFCTL_DGFSEL_CLK_3                   ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define I2C_GFCTL_DGFSEL_CLK_4                   ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define I2C_GFCTL_DGFSEL_CLK_8                   ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define I2C_GFCTL_DGFSEL_CLK_16                  ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define I2C_GFCTL_DGFSEL_CLK_31                  ((uint32_t)0x00000007U)         /* !< 31 clocks */
/* I2C_GFCTL[AGFEN] Bits */
#define I2C_GFCTL_AGFEN_OFS                      (8)                             /* !< AGFEN Offset */
#define I2C_GFCTL_AGFEN_MASK                     ((uint32_t)0x00000100U)         /* !< Analog Glitch Suppression Enable */
#define I2C_GFCTL_AGFEN_DISABLE                  ((uint32_t)0x00000000U)         /* !< Analog Glitch Filter disable */
#define I2C_GFCTL_AGFEN_ENABLE                   ((uint32_t)0x00000100U)         /* !< Analog Glitch Filter enable */
/* I2C_GFCTL[CHAIN] Bits */
#define I2C_GFCTL_CHAIN_OFS                      (11)                            /* !< CHAIN Offset */
#define I2C_GFCTL_CHAIN_MASK                     ((uint32_t)0x00000800U)         /* !< Analog and digital noise filters
                                                                                    chaining enable. */
#define I2C_GFCTL_CHAIN_DISABLE                  ((uint32_t)0x00000000U)         /* !< When 0, chaining is disabled and
                                                                                    only digital filter output is
                                                                                    available to IP logic for
                                                                                    oversampling */
#define I2C_GFCTL_CHAIN_ENABLE                   ((uint32_t)0x00000800U)         /* !< When 1, analog and digital glitch
                                                                                    filters are chained and the output of
                                                                                    the combination is made available to
                                                                                    IP logic for oversampling */

/* I2C_TIMEOUT_CTL Bits */
/* I2C_TIMEOUT_CTL[TCNTLA] Bits */
#define I2C_TIMEOUT_CTL_TCNTLA_OFS               (0)                             /* !< TCNTLA Offset */
#define I2C_TIMEOUT_CTL_TCNTLA_MASK              ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.   Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define I2C_TIMEOUT_CTL_TCNTLA_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define I2C_TIMEOUT_CTL_TCNTLA_MAXIMUM           ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* I2C_TIMEOUT_CTL[TCNTAEN] Bits */
#define I2C_TIMEOUT_CTL_TCNTAEN_OFS              (15)                            /* !< TCNTAEN Offset */
#define I2C_TIMEOUT_CTL_TCNTAEN_MASK             ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define I2C_TIMEOUT_CTL_TCNTAEN_DISABLE          ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define I2C_TIMEOUT_CTL_TCNTAEN_ENABLE           ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */
/* I2C_TIMEOUT_CTL[TCNTLB] Bits */
#define I2C_TIMEOUT_CTL_TCNTLB_OFS               (16)                            /* !< TCNTLB Offset */
#define I2C_TIMEOUT_CTL_TCNTLB_MASK              ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Load: Counter B is
                                                                                    used for SCL High Detection. This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit pre-load value for the Timeout
                                                                                    B count. NOTE: The value of CNTLB
                                                                                    must be greater than 1h.   Each count
                                                                                    is equal to 1* clock period. For
                                                                                    example, with 10MHz functional clock
                                                                                    one timeout period will be equal
                                                                                    to1*100ns. */
#define I2C_TIMEOUT_CTL_TCNTLB_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define I2C_TIMEOUT_CTL_TCNTLB_MAXIMUM           ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* I2C_TIMEOUT_CTL[TCNTBEN] Bits */
#define I2C_TIMEOUT_CTL_TCNTBEN_OFS              (31)                            /* !< TCNTBEN Offset */
#define I2C_TIMEOUT_CTL_TCNTBEN_MASK             ((uint32_t)0x80000000U)         /* !< Timeout Counter B Enable */
#define I2C_TIMEOUT_CTL_TCNTBEN_DISABLE          ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define I2C_TIMEOUT_CTL_TCNTBEN_ENABLE           ((uint32_t)0x80000000U)         /* !< Enable Timeout Counter B */

/* I2C_TIMEOUT_CNT Bits */
/* I2C_TIMEOUT_CNT[TCNTA] Bits */
#define I2C_TIMEOUT_CNT_TCNTA_OFS                (0)                             /* !< TCNTA Offset */
#define I2C_TIMEOUT_CNT_TCNTA_MASK               ((uint32_t)0x000000FFU)         /* !< Timeout Count A Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter A */
#define I2C_TIMEOUT_CNT_TCNTA_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define I2C_TIMEOUT_CNT_TCNTA_MAXIMUM            ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* I2C_TIMEOUT_CNT[TCNTB] Bits */
#define I2C_TIMEOUT_CNT_TCNTB_OFS                (16)                            /* !< TCNTB Offset */
#define I2C_TIMEOUT_CNT_TCNTB_MASK               ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter B */
#define I2C_TIMEOUT_CNT_TCNTB_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define I2C_TIMEOUT_CNT_TCNTB_MAXIMUM            ((uint32_t)0x00FF0000U)         /* !< Highest possible value */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_i2c__include */
